/*******************************
 *
 * 第 19 章 环境变量函数
 *
**********************************/


char * getenv(const char *name);
/*************************************************
 * 功能说明：   getenv(取得环境变量内容)
 * 表头文件：   #include <stdlib.h>
 * 定义函数：   char * getenv(const char *name);
 * 函数说明：   getenv（）用来取得参数name环境变量的内容。参数name为环境
				变量的名称，如果该变量存在则会返回指向该内容的指针。
				环境变量的格式为name＝value。
 * 返回值  ：   执行成功则返回指向该内容的指针，找不到符合的环境变量名称则返回NULL。 
 * 附加说明：   使用指令env----打印当前的环境变量 
**************************************************/

int putenv(const char * string);
/*************************************************
 * 功能说明：   putenv(改变或增加环境变量)
 * 表头文件：   #include <stdlib.h>
 * 定义函数：   int putenv(const char * string);
 * 函数说明：   putenv（）用来改变或增加环境变量的内容。参数string 的格式为
				name＝value，如果该环境变量原先存在，则变量内容会依参数string
				改变，否则此参数内容会成为新的环境变量。
 * 返回值  ：   执行成功则返回0，有错误发生则返回-1。
 * 错误说明：   ENOMEM 内存不足，无法配置新的环境变量空间
 * 附加说明：   
**************************************************/

int setenv(const char *name,const char * value,int overwrite);
/*************************************************
 * 功能说明：   setenv(改变或增加环境变量)
 * 表头文件：   #include <stdlib.h>
 * 定义函数：   int setenv(const char *name,const char * value,int overwrite);
 * 函数说明：   setenv（）用来改变或增加环境变量的内容。参数name为环境变量
				名称字符串，参数value则为变量内容，参数overwrite用来决定是
				否要改变已存在的环境变量。如果overwrite不为0，而该环境变量
				原已有内容，则原内容会被改为参数value 所指的变量内容：如果
				overwrite为0，且该环境变量已有内容，则参数value会被忽略。
 * 返回值  ：   执行成功则返回0，有错误发生时返回-1。
 * 错误说明：   ENOMEM 内存不足，无法配置新的环境变量空间
 * 附加说明：   
**************************************************/

int unsetenv(const char *name);
/*************************************************
 * 功能说明：   unsetenv(清除环境变量内容)
 * 表头文件：   #include <stdlib.h>
 * 定义函数：   int unsetenv(const char *name);
 * 函数说明：   清除name对应的环境变量
 * 返回值  ：   执行成功则返回0，有错误发生时返回-1。
 * 错误说明：   EINVAL name是空指针或者指向空字符串或者是包含'='的字符串
 * 附加说明：   
**************************************************/

