/*******************************
 *
 * 第 17 章 进程通信函数
 *
**********************************/


ftok(将文件路径和计划代号转为SystemcVIPCkey)
msgctl(控制信息队列的运作)
msgget(建立信息队列)
msgrcv(从信息队列读取信息)
msgsnd(将信息送入信息队列)
semctl(控制信号队列的操作)
semget(配置信号队列)
semop(信号处理)
shmat(attach共享内存)
shmctl(控制共享内存的操作)
shmdt(detach共享内存)
shmget(配置共享内存)
/*************************************************
 * 功能说明：   
 * 表头文件：   #include <unistd.h>
 * 定义函数：   
 * 函数说明：
 * 返回值  ：
 * 错误说明： 
 * 附加说明：   
**************************************************/

