/***********************************
 *
 *  第一章 字符测试函数
 *  
***********************************/

#include <ctype.h>

int isalnum(int c);
 /*************************************************
 * 相关函数： isalnum，islower，isupper
 * 表头文件： #include<ctype.h>
 * 定义函数： int isalnum (int c)
 * 函数说明： 检查参数c是否为英文字母或阿拉伯数字，在标准c中相当于使用
             （isalpha( c )|| isdigit( c )）做测试。
 * 返回值  ： 若参数c为英文字母或阿拉伯数字，则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int isalpha(int c);
/*************************************************
 * 相关函数： isalnum，islower，isupper
 * 表头文件： #include<ctype.h>
 * 定义函数： int isalpha (int c)
 * 函数说明： 检查参数c是否为英文字母，在标准c中相当于使用（isupper（c）
              ||islower（c））做测试。
 * 返回值  ： 若参数c为英文字母，则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int isascii(int c);
/*************************************************
 * 相关函数： isalnum，islower，isupper
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为ASCII码字符，也就是判断c的范围是否在0到127 之间。
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int isblank(int c);
/*************************************************
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为 space或者tab键
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int iscntrl(int c);
/*************************************************
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为ASCII控制码，也就是判断c的范围是否在0到30 之间
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int isdigit(int c);
/*************************************************
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为阿拉伯数字
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int isgraph(int c);
/*************************************************
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为可打印字符，若c所对映的ASCII 码可打印，且非空格字符则返回TRUE
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int islower(int c);
/*************************************************
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为小写英文字母
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int isprint(int c);
/*************************************************
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为可打印字符，若c所对映的ASCII 码可打印，其中包含空格字符，则返回TRUE。
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int ispunct(int c);
/*************************************************
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为标点符号或特殊符号。
              返回TRUE 也就是代表参数c为非空格、非数字和非英文字母。
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int isspace(int c);
/*************************************************
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为空格字符，也就是判断是否为空格（’’）、定位字符（’\t’）、
              CR（’\r’）、换行（’\n’）、垂直定位字符（’\v’）或翻页（’\f’）的情况。
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int isupper(int c);
/*************************************************
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为大写英文字母
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

int isxdigit(int c);
/*************************************************
 * 表头文件： #include<ctype.h>
 * 函数说明： 检查参数c是否为16 进制数字，只要c为下列其中一个情况则返回TRUE。
              16 进制数字：0123456789ABCDEF
 * 返回值  ： 若是则返回TRUE，否则返回NULL( 0 )。
 * 附加说明： 此为宏定义，非真正函数
**************************************************/

