/************************
 *
 * 第九章 流IO--标准IO函数
 *
******************************/

FILE * fopen(const char * path,const char * mode);
/*************************************************
 * 功能说明： fopen(打开文件)
 * 表头文件： #include<stdio.h>
 * 定义函数： FILE * fopen(const char * path,const char * mode);
 * 函数说明： path字符串是文件路径及文件名
              mode字符串则代表着流形态，mode有下列几种形态字符串：
				    r   打开只读文件，该文件必须存在。
					r+  打开可读写的文件，该文件必须存在。
					w   打开只写文件，若文件存在则文件长度清为0，即该文件内容会消失。若文件不存在则建立该文件。
					w+  打开可读写文件，若文件存在则文件长度清为零，即该文件内容会消失。若文件不存在则建立该文件。
					a   以附加的方式打开只写文件。若文件不存在，则会建立该文
					    件，如果文件存在，写入的数据会被加到文件尾，即文件原先的内
					    容会被保留。
					a+  以附加方式打开可读写的文件。若文件不存在，则会建立该文
					    件，如果文件存在，写入的数据会被加到文件尾后，即文件原先的
					    内容会被保留。
						
					上述的形态字符串都可以再加一个b 字符，如rb、w+b 或ab＋等组
					合，加入b字符用来告诉函数库打开的文件为二进制文件，而非纯文字文件
 * 返回值  ： 文件顺利打开后，指向该流的文件指针就会被返回。若果文件打开
              失败则返回NULL，并把错误代码存在errno中。
 * 附加说明： 一般而言，开文件后会作一些文件读取或写入的动作，若开文件失
              败，接下来的读写动作也无法顺利进行，所以在fopen（）后请作错误判断及处理。

	    例子： FILE *fp = fopen("xxx", "r");   //只读
			   FILE *fp = fopen("xxx", "w+");  //打开并清空可读写文件
			   FILE *fp = fopen("xxx", "wb");
**************************************************/

int fclose(FILE * stream);
/*************************************************
 * 功能说明：  fclose(关闭文件)
 * 表头文件：  #include <stdio.h>
 * 定义函数：  int fclose(FILE * stream);
 * 函数说明：  fclose()用来关闭先前fopen()打开的文件. 
               此动作会让缓冲区内的数据写入文件中, 并释放系统所提供的文件资源.	  
 * 返回值  ：  若关文件动作成功则返回0, 有错误发生时则返回EOF 并把错误代码存到errno.
 * 错误代码：  EBADF 表示参数stream 非已打开的文件.
 * 附加说明：  
**************************************************/

size_t fread(void * ptr,size_t size,size_t nmemb,FILE * stream);
/*************************************************
 * 功能说明：  fread(从文件流读取数据)
 * 表头文件：  #include<stdio.h>
 * 定义函数：  size_t fread(void * ptr,size_t size,size_t nmemb,FILE * stream);
 * 函数说明：  fread（）用来从文件流中读取数据。
               stream为已打开的文件指针，
               ptr 指向欲存放读取进来的数据空间，读取的字符数以参数size*nmemb来决定。
			   fread（）会返回实际读取到的nmemb 数目，如果此值比参数nmemb 来得小，则代表可能读到了文件尾或有错
			   误发生，这时必须用feof（）或ferror（）来决定发生什么情况。	  
 * 返回值  ：  返回实际读取到的nmemb 数目
 * 附加说明： 
**************************************************/

size_t fwrite(const void * ptr,size_t size,size_t nmemb,FILE * stream);
/*************************************************
 * 功能说明：  fwrite(将数据写至文件流)
 * 表头文件：  #include<stdio.h>
 * 定义函数：  size_t fwrite(const void * ptr,size_t size,size_t nmemb,FILE * stream);
 * 函数说明：  fwrite（）用来将数据写入文件流中。参数stream 为已打开的文件
			   指针，参数ptr 指向欲写入的数据地址，总共写入的字符数以参数
               size*nmemb来决定。fwrite（）会返回实际写入的nmemb 数目。	  
 * 返回值  ：  返回实际写入的nmemb 数目。
 * 附加说明： 
**************************************************/

int fflush(FILE* stream);
/*************************************************
 * 功能说明：  fflush(更新缓冲区)
 * 表头文件：  #include <stdio.h>
 * 定义函数：  int fflush(FILE* stream);
 * 函数说明：  fflush（）会强迫将缓冲区内的数据写回参数stream指定的文件中。
               如果参数stream为NULL，fflush（）会将所有打开的文件数据更新。	  
 * 返回值  ：  成功返回0，失败返回EOF，错误代码存于errno中。
 * 错误代码：  EBADF 参数stream 指定的文件未被打开，或打开状态为只读。
*************************************************************************/

int fseek(FILE * stream,long offset,int whence);
/*************************************************
 * 功能说明：  fseek(移动文件流的读写位置)
 * 表头文件：  #include<stdio.h>
 * 定义函数：  int fseek(FILE * stream,long offset,int whence);
 * 函数说明：  fseek（）用来移动文件流的读写位置。
               stream为已打开的文件指针，
			   offset为根据参数whence来移动读写位置的位移数。
			   whence为下列其中一种：
			       SEEK_SET从距文件开头offset位移量为新的读写位置。
			       SEEK_CUR以目前的读写位置往后增加offset个位移量。
			       SEEK_END 将读写位置指向文件尾后再增加offset个位移量。
                   当whence 值为SEEK_CUR 或SEEK_END 时，参数offset 允许负
                   值的出现。
			   下列是较特别的使用方式：
                    1) 将读写位置移动到文件开头时： fseek(FILE * stream,0,SEEK_SET);
                    2) 将读写位置移动到文件尾时： fseek(FILE * stream,0,0SEEK_END);				   
 * 返回值  ：  当调用成功时则返回0，若有错误则返回-1，errno会存放错误代码。
 * 附加说明：  fseek（）不像lseek（）会返回读写位置，
               因此必须使用ftell（）来取得目前读写的位置。
********************************************************************/

int feof(FILE * stream);
/*************************************************
 * 功能说明：  feof(检查文件流是否读到了文件尾)
 * 表头文件：  #include<stdio.h>
 * 定义函数：  int feof(FILE * stream);
 * 函数说明：  feof（）用来侦测是否读取到了文件尾，stream为fopen（）所
               返回之文件指针。如果已到文件尾则返回非零值，其他情况返回0。	  
 * 返回值  ：  返回非零值代表已到达文件尾 
********************************************************************/

int fgetc(FILE * stream);
/*************************************************
 * 功能说明：  fgetc(由文件中读取一个字符)
 * 表头文件：  #include<stdio.h>
 * 定义函数：  int fgetc(FILE * stream);
 * 函数说明：  fgetc（）用来从参数stream所指的文件中读取一个字符。
               若读到文件尾而无数据时便返回EOF。	  
 * 返回值  ：  返回读取到的字符，若返回 EOF则表示到了文件尾
********************************************************************/

int fputc(int c,FILE * stream);
/*************************************************
 * 功能说明：  fputc(将一指定字符写入文件流中)
 * 表头文件：  #include<stdio.h>
 * 定义函数：  int fputc(int c,FILE * stream);
 * 函数说明：  fputc 会将参数c 转为unsigned char 后写入参数stream指定的文件中。	  
 * 返回值  ：  fputc（）会返回写入成功的字符，即参数c。若返回EOF则代表写入失败。
********************************************************************/

char * fgets(char * s,int size,FILE * stream);
/*************************************************
 * 功能说明：  fgets(由文件中读取一字符串)
 * 表头文件：  #include<stdio.h>
 * 定义函数：  char * fgets(char * s,int size,FILE * stream);
 * 函数说明：  fgets（）用来从参数stream所指的文件内读入字符并存到参数s所
               指的内存空间，直到出现换行字符、读到文件尾或是已读了size-1
               个字符为止，最后会加上NULL作为字符串结束。	  
 * 返回值  ：  fgets（）若成功则返回s指针，返回NULL则表示有错误发生。
********************************************************************/

int fputs(const char * s,FILE * stream);
/*************************************************
 * 功能说明：  fputs(将一指定的字符串写入文件内)
 * 表头文件：  #include<stdio.h>
 * 定义函数：  int fputs(const char * s,FILE * stream);
 * 函数说明：  fputs（）用来将参数s所指的字符串写入到参数stream所指的文件内。  
 * 返回值  ：  若成功则返回写出的字符个数，返回EOF则表示有错误发生。
********************************************************************/

int getc(FILE * stream);
/*************************************************
 * 功能说明：  getc(由文件中读取一个字符)
 * 表头文件：  #include <stdio.h>
 * 定义函数：  int getc(FILE * stream);
 * 函数说明：  getc（）用来从参数stream所指的文件中读取一个字符。若读到文
               件尾而无数据时便返回EOF。虽然getc（）与fgetc（）作用相同，
               但getc（）为宏定义，非真正的函数调用。  
 * 返回值  ：  getc（）会返回读取到的字符，若返回EOF则表示到了文件尾。
********************************************************************/

int putc(int c,FILE * stream);
/*************************************************
 * 功能说明：  putc(将一指定字符写入文件中)
 * 表头文件：  #include <stdio.h>
 * 定义函数：  int putc(int c,FILE * stream);
 * 函数说明：  putc（）会将参数c转为unsigned char 后写入参数stream指定的文件中。
               虽然putc（）与fputc（）作用相同，但putc（）为宏定义，非真正的函数调用。  
 * 返回值  ：  putc（）会返回写入成功的字符，即参数c。若返回EOF 则代表写入失败。。
********************************************************************/

char * gets(char *s);
/*************************************************
 * 功能说明：  gets(由标准输入设备内读进一字符串)
 * 表头文件：  #include <stdio.h>
 * 定义函数：  char * gets(char *s);
 * 函数说明：  gets（）用来从标准设备读入字符并存到参数s 所指的内存空间，
               直到出现换行字符或读到文件尾为止，最后加上NULL作为字符串结束。
			   
 * 返回值  ：  gets（）若成功则返回s指针，返回NULL则表示有错误发生。
 * 附件说明：  由于gets（）无法知道字符串s 的大小，必须遇到换行字符或文件
               尾才会结束输入，因此容易造成缓冲溢出的安全性问题。
			   建议使用fgets（）取代。
********************************************************************/

int puts(const char *string);
/*************************************************
 * 功能说明：  puts(将指定的字符串写到标准输出设备)
 * 表头文件：  #include <stdio.h>
 * 定义函数：  int puts(const char *string);
 * 函数说明：  puts()函数用来向标准输出设备（屏幕）输出字符串并换行，
               具体为：把字符串输出到标准输出设备，将'\0'转换为回车换行。	   
 * 返回值  ：  
********************************************************************/

int getchar(void);
/****************************************************************
 * 功能说明：  getchar(由标准输入设备内读进一字符)
 * 表头文件：  #include <stdio.h>
 * 定义函数：  int getchar(void);
 * 函数说明：  getchar（）用来从标准输入设备中读取一个字符。
               然后将该字符从unsigned char 转换成int后返回。		   
 * 返回值  ：  getchar（）会返回读取到的字符，若返回EOF则表示有错误发生。
 * 附件说明：  getchar（）非真正函数，而是getc（stdin）宏定义
********************************************************************/

int putchar (int c);
/****************************************************************
 * 功能说明：  putchar(将指定的字符写到标准输出设备)
 * 表头文件：  #include <stdio.h>
 * 定义函数：  int putchar (int c);
 * 函数说明：  putchar（）用来将参数c字符写到标准输出设备。		   
 * 返回值  ：  putchar（）会返回输出成功的字符，即参数c。
               若返回EOF则代表输出失败。
 * 附件说明：  putchar（）非真正函数，而是putc（c，stdout）宏定义。
********************************************************************/

FILE * fdopen(int fildes,const char * mode);
/****************************************************************
 * 功能说明：  fdopen(将文件描述词转为文件指针)
 * 表头文件：  #include <stdio.h>
 * 定义函数：  FILE * fdopen(int fildes,const char * mode);
 * 函数说明：  fdopen（）会将参数fildes 的文件描述词，转换为对应的文件指针
			   后返回。参数mode 字符串则代表着文件指针的流形态，此形态必
			   须和原先文件描述词读写模式相同。
			   关于mode 字符串格式请参考fopen（）。		   
 * 返回值  ：  转换成功时返回指向该流的文件指针。失败则返回NULL，并把错误代码存在errno中。
********************************************************************/

int fgetpos(FILE * restrict stream，fpos_t * restrict pos);
/*************************************************
 * 功能说明：   fgetpos(取得文件流的读取位置)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   int fgetpos(FILE * restrict stream，fpos_t * restrict pos);
 * 函数说明： 	在pos所指的位置放置一个fpos_t值，这个值描述了文件中的一个位置	  
 * 返回值  ：   如果成功，函数返回0；否则返回一个非零值
********************************************************************/

int fsetpos(FILE *stream, const fpos_t *pos);
/*************************************************
 * 功能说明：   fsetpos(移动文件流的读写位置)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   int fsetpos(FILE *stream, const fpos_t *pos);
 * 函数说明： 		  
 * 返回值  ：   成功返回0，否则返回非0。
********************************************************************/

int fileno(FILE * stream);
/*************************************************
 * 功能说明：  fileno(返回文件流所使用的文件描述词)
 * 表头文件：  #include <stdio.h>
 * 定义函数：  int fileno(FILE * stream);
 * 函数说明：  fileno()用来取得参数stream 指定的文件流所使用的文件描述词.	  
 * 返回值  ：  返回文件描述词.
********************************************************************/

FILE * freopen(const char * path,const char * mode,FILE * stream);
/*************************************************
 * 功能说明：   freopen(打开文件)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   FILE * freopen(const char * path,const char * mode,FILE * stream);
 * 函数说明： 	参数path字符串包含欲打开的文件路径及文件名，参数mode请参
			    考fopen（）说明。参数stream为已打开的文件指针。freopen（）
			    会将原stream所打开的文件流关闭，然后打开参数path的文件。	  
 * 返回值  ：   文件顺利打开后，指向该流的文件指针就会被返回。如果文件打开
                失败则返回NULL，并把错误代码存在errno中。
*****************************************************************/

long ftell(FILE * stream);
/*************************************************
 * 功能说明：   ftell(取得文件流的读取位置)
 * 表头文件：   #include<stdio.h>
 * 定义函数：   long ftell(FILE * stream);
 * 函数说明： 	ftell（）用来取得文件流目前的读写位置。
                参数stream 为已打开的文件指针。	  
 * 返回值  ：   当调用成功时则返回目前的读写位置，若有错误则返回-1，
                errno会存放错误代码。
 * 错误代码：   EBADF 参数stream无效或可移动读写位置的文件流
*****************************************************************/

char * mktemp(char * template);
/*************************************************
 * 功能说明：  mktemp(产生唯一的临时文件文件名)
 * 表头文件：  #include <stdlib.h>
 * 定义函数：  char * mktemp(char * template);
 * 函数说明：  mktemp（）用来产生唯一的临时文件名。
               template所指的文件名称字符串中最后六个字符必须是XXXXXX。产生后的文件名会
               借字符串指针返回。	  
 * 返回值  ：  文件顺利打开后，指向该流的文件指针就会被返回。如果文件打开
               失败则返回NULL，并把错误代码存在errno中。
 * 附加说明：  参数template 所指的文件名称字符串必须声明为数组，
               如char template[ ]=”template-XXXXXX” ； 
               不可用char *template=”template-XXXXXX”；
*****************************************************************/

void rewind(FILE * stream);
/*************************************************
 * 功能说明：   rewind(重设文件流的读写位置为文件开头)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   void rewind(FILE * stream);
 * 函数说明： 	rewind（）用来把文件流的读写位置移至文件开头
                此函数相当于调用fseek（stream，0,SEEK_SET）	  
*****************************************************************/

void setbuf(FILE * stream,char * buf);
/*************************************************
 * 功能说明：   setbuf(设置文件流的缓冲区)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   void setbuf(FILE * stream,char * buf);
 * 函数说明： 	在打开文件流后，读取内容之前，调用setbuf（）可以用来设置文件流的缓冲区。
				参数stream为指定的文件流，
				参数buf指向自定的缓冲区起始地址。
				如果参数buf为NULL指针，则为无缓冲IO。
				setbuf（）相当于调用：setvbuf(stream,buf,buf?_IOFBF:_IONBF,BUFSIZ)；	  
*****************************************************************/

void setbuffer(FILE * stream,char * buf,size_t size);
/*************************************************
 * 功能说明：   setbuffer(设置文件流的缓冲区)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   void setbuffer(FILE * stream,char * buf,size_t size);
 * 函数说明： 	在打开文件流后，读取内容之前，调用setbuffer（）可用来设置文
				件流的缓冲区。参数stream为指定的文件流，
				参数buf指向自定的缓冲区起始地址，参数size为缓冲区大小。	  
*****************************************************************/

void setlinebuf(FILE * stream);
/*************************************************
 * 功能说明：   setlinebuf(设置文件流为线性缓冲区)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   void setlinebuf(FILE * stream);
 * 函数说明： 	setlinebuf（）用来设置文件流以换行为依据的无缓冲IO。
                相当于调用：setvbuf(stream,(char * )NULL,_IOLBF,0);  
*****************************************************************/

int setvbuf(FILE * stream,char * buf,int mode,size_t size);
/*************************************************
 * 功能说明：   setvbuf(设置文件流的缓冲区)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   int setvbuf(FILE * stream,char * buf,int mode,size_t size);
 * 函数说明： 	在打开文件流后，读取内容之前，调用setvbuf（）可以用来设置文
                件流的缓冲区。参数stream为指定的文件流，
			    参数buf指向自定的缓冲区起始地址，
			    参数size为缓冲区大小，
			    参数mode有下列几种：
					_IONBF   无缓冲IO
					_IOLBF   以换行为依据的无缓冲IO
					_IOFBF   完全无缓冲IO。如果参数buf为NULL指针，则为无缓冲IO
*****************************************************************/

FILE *tmpfile(void);
/*************************************************
 * 功能说明：   tmpfile(建立临时文件)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   FILE *tmpfile(void);
 * 函数说明： 	功能是以wb+形式创建一个临时二进制文件
				创建的临时文件在程序退出时会被自动删除。
				
				它会创建一个temporay文件在 /tmp文件夹中
				
 * 返回值：     如果成功，该函数返回一个流指针创建的临时文件。
                如果不能创建文件，则返回NULL。
*****************************************************************/

int ungetc(int c,FILE * stream);
/*************************************************
 * 功能说明：   ungetc(将一指定字符写回文件流中)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   int ungetc(int c,FILE * stream);
 * 函数说明： 	ungetc（）将参数c 字符写回参数stream所指定的文件流。
                这个写回的字符会由下一个读取文件流的函数取得。
 * 返回值：     成功则返回c字符，若有错误则返回EOF。
*****************************************************************/

void clearerr(FILE * stream);
/*************************************************
 * 功能说明：   clearerr(清除文件流的错误旗标)
 * 表头文件：   #include <stdio.h>
 * 定义函数：   void clearerr(FILE * stream);
 * 函数说明： 	clearerr（）清除参数stream指定的文件流所使用的错误旗标。	  
*****************************************************************/