/***********************************
 *
 *  第二章 字符串操作函数
 *  
***********************************/

#include <stdlib.h>

double atof(const char *nptr);
/*************************************************
 * 功能说明： 将字符串转换成浮点型数
 * 相关函数： atoi，atol，strtod，strtol，strtoul
 * 表头文件： #include <stdlib.h>
 * 定义函数： double atof(const char *nptr);
 * 函数说明： atof（）会扫描参数nptr字符串，跳过前面的空格字符，直到遇上
              数字或正负符号才开始做转换，而再遇到非数字或字符串结束时
             （’\0’）才结束转换，并将结果返回。参数nptr 字符串可包含正负
              号、小数点或E（e）来表示指数部分，如123.456 或123e-2。
			  
 * 返回值  ： 返回转换后的浮点型数。
 * 附加说明： atof()与使用strtod（nptr,(char**)NULL）；结果相同。
**************************************************/

int atoi(const char *nptr);
/*************************************************
 * 功能说明： 将字符串转换成整型数
 * 相关函数： atoi，atol，strtod，strtol，strtoul
 * 表头文件： #include <stdlib.h>
 * 定义函数： int atoi(const char *nptr);
 * 函数说明： 扫描参数nptr字符串，跳过前面的空格字符，直到遇上
              数字或正负符号才开始做转换，而再遇到非数字或字符串结束时
             （’\0’）才结束转换，并将结果返回。
			  
 * 返回值  ： 返回转换后的整型数。
 * 附加说明： atof()与使用strtol(nptr，（char**）NULL，10)；结果相同。
***********************************************************************/

long atol(const char *nptr);
/*************************************************
 * 功能说明： 将字符串转换成长整型数
 * 相关函数： atoi，atol，strtod，strtol，strtoul
 * 表头文件： #include <stdlib.h>
 * 定义函数： long atof(const char *nptr);
 * 函数说明： 扫描参数nptr字符串，跳过前面的空格字符，直到遇上
              数字或正负符号才开始做转换，而再遇到非数字或字符串结束时
             （’\0’）才结束转换，并将结果返回。
			  
 * 返回值  ： 返回转换后的长整型数。
 * 附加说明： atof()与使用strtol(nptr,(char**)NULL,10)；结果相同。
***********************************************************************/

char *gcvt(double number，size_t ndigits，char *buf);
/*************************************************
 * 功能说明： 将浮点型整数转换为字符串，取四舍五入
 * 相关函数： ecvt，fcvt，sprintf
 * 表头文件： #include <stdlib.h>
 * 定义函数： char *gcvt(double number，size_t ndigits，char *buf);
 * 函数说明： gcvt()用来将参数number 转换成ASCII码字符串，参数ndigits表示
              显示的位数。gcvt()与ecvt()和fcvt()不同的地方在于，gcvt()所转换
              后的字符串包含小数点或正负符号。若转换成功，转换后的字符串
              会放在参数buf指针所指的空间。
 * 返回值  ： 返回一字符串指针，此地址即为buf指针。
 * 附加说明： 
***********************************************************************/

double strtod(const char *nptr,char **endptr);
/*************************************************
 * 功能说明： 将字符串转换成浮点数:str to double
 * 相关函数： atoi，atol，strtod，strtol，strtoul
 * 表头文件： #include <stdlib.h>
 * 定义函数： double strtod(const char *nptr,char **endptr);
 * 函数说明： strtod()会扫描参数nptr 字符串，跳过前面的空格字符，直到遇上数
              字或正负符号才开始做转换，直到出现非数字或字符串结束时
             （’\0’）才结束转换，并将结果返回。若endptr 不为NULL，则会
              将遇到不合条件而终止的nptr 中的字符指针由endptr 传回,
			  若 endptr 为 NULL，则表示该参数无效，或不使用该参数。参数
              nptr 字符串可包含正负号、小数点或E(e)来表示指数部分。如123.456 或123e-2。
 * 返回值  ： 返回转换后的浮点型数
 * 附加说明： 
			#include <stdio.h>
			#include <string.h>  
			#include <stdlib.h> 

			int main(void)
			{
				char a[] = "100000000";
				char b[] = "100000";
				char c[] = "ffff";
				
				printf("a = %lf\n", strtod(a, NULL));
				printf("b= %lf\n", strtod(b, NULL));
				printf("c = %lf\n", strtod(c, NULL));
				return 0;
			}
***********************************************************************/

long int strtol(const char *nptr,char **endptr,int base);
/*************************************************
 * 功能说明： 将字符串转换成长整型数:str to long
 * 相关函数： atof，atoi，atol，strtod，strtoul
 * 表头文件： #include <stdlib.h>
 * 定义函数： long int strtol(const char *nptr,char **endptr,int base);
 * 函数说明： strtol（）会将参数nptr 字符串根据参数base 来转换成长整型数。
			  参数base 范围从2 至36，或0。参数base 代表采用的进制方式，
			  如base值为10 则采用10 进制，若base值为16 则采用16 进制等。
			  当base 值为0 时则是采用10 进制做转换，但遇到如’0x’前置字符
			  则会使用16进制做转换。一开始strtol（）会扫描参数nptr 字符串，
			  跳过前面的空格字符，直到遇上数字或正负符号才开始做转换，再
			  遇到非数字或字符串结束时(‘\0’)结束转换，并将结果返回。若参数
			  endptr 不为NULL，则会将遇到不合条件而终止的nptr 中的字符指
			  针由endptr 返回。
 * 返回值  ： 返回转换后的长整型数，否则返回ERANGE 并将错误代码存入errno中
 * 附加说明： ERANGE 指定的转换字符串超出合法范围
***********************************************************************/

unsigned long int strtoul(const char *nptr,char **endptr,int base);
/*************************************************
 * 功能说明： 将字符串转换成长整型数:str to long
 * 相关函数： atof，atoi，atol，strtod，strtol
 * 表头文件： #include <stdlib.h>
 * 定义函数： unsigned long int strtoul(const char *nptr,char **endptr,int base);
 * 函数说明： strtol（）会将参数nptr 字符串根据参数base 来转换成无符号长整型数。
			  参数base 范围从2 至36，或0。参数base 代表采用的进制方式，
			  如base值为10 则采用10 进制，若base值为16 则采用16 进制等。
			  当base 值为0 时则是采用10 进制做转换，但遇到如’0x’前置字符
			  则会使用16进制做转换。一开始strtol（）会扫描参数nptr 字符串，
			  跳过前面的空格字符，直到遇上数字或正负符号才开始做转换，再
			  遇到非数字或字符串结束时(‘\0’)结束转换，并将结果返回。若参数
			  endptr 不为NULL，则会将遇到不合条件而终止的nptr 中的字符指
			  针由endptr 返回。
 * 返回值  ： 返回转换后的长整型数，否则返回ERANGE 并将错误代码存入errno中
 * 附加说明： ERANGE 指定的转换字符串超出合法范围
***********************************************************************/

int toascii(int c);
/*************************************************
 * 功能说明： 将整型数转换成合法的ASCII 码字符
 * 相关函数： atof，atoi，atol，strtod，strtol
 * 表头文件： #include<ctype.h>
 * 定义函数： int toascii(int c)
 * 函数说明： toascii（）会将参数c转换成7 位的unsigned char 值，
              第八位则会被清除，此字符即会被转成ASCII码字符。
 * 返回值  ： 将转换成功的ASCII码字符值返回。
 * 附加说明： 
***************************************************************/

int tolower(int c);
/*************************************************
 * 功能说明： 将大写字母转换成小写字母
 * 相关函数： isalpha，toupper
 * 表头文件： #include<ctype.h>
 * 定义函数： int tolower(int c);
 * 函数说明： 若参数c为大写字母则将该对应的小写字母返回。
 * 返回值  ： 返回转换后的小写字母，若不须转换则将参数c值返回。
 * 附加说明： 
***************************************************************/

int toupper(int c);
/*************************************************
 * 功能说明： 将小写字母转换成大写字母
 * 相关函数： isalpha，toupper
 * 表头文件： #include<ctype.h>
 * 定义函数： int toupper(int c);
 * 函数说明： 若参数c为小写字母则将该对映的大写字母返回。
 * 返回值  ： 返回转换后的大写字母，若不须转换则将参数c值返回。
 * 附加说明： 
***************************************************************/

char * strtok(char *s, const char *delim);
/*************************************************
 * 功能说明： 分割字符串
 * 表头文件： #include<string.h>
 * 定义函数： char * strtok(char *s, const char *delim);
 * 函数说明： strtok()用来将字符串分割成一个个片段。
              参数s 指向欲分割的字符串，参数delim 则为分割字符串；
			  当strtok()在参数s 的字符串中发现到参数delim 的分割字符时则会将该字符改为\0 字符。
			  在第一次调用时，strtok()必需给予参数s 字符串，往后的调用则将参数s 设置成NULL。
			  每次调用成功则返回下一个分割后的字符串指针。
 * 返回值  ： 返回下一个分割后的字符串指针，如果已无从分割则返回NULL。
 * 附加说明： 
***************************************************************/

char *strstr( char *str, char * substr );
/*************************************************
 * 功能说明： 检索子串在字符串中首次出现的位置
 * 表头文件： #include<string.h>
 * 定义函数： char *strstr( char *str, char * substr );
 * 函数说明： str为要检索的字符串，substr为要检索的子串。
 * 返回值  ： 返回字符串str中第一次出现子串substr的地址；
			  如果没有检索到子串，则返回NULL。

 * 附加说明： 
		#include <stdio.h>
		#include <string.h>
		int main(void)
		{
			char *str = "http://see.xidian.edu.cn/cpp/u/xitong/";
			char *substr = "see";
			char *s = strstr(str, substr);
			printf("%s\n", s);   //see.xidian.edu.cn/cpp/u/xitong/
			
			return 0;
		}
***************************************************************/

size_t strspn(const char *str, const char * accept);
/*************************************************
 * 功能说明： 计算字符串 str 中连续有几个字符都属于字符串 accept
 * 表头文件： #include <string.h>
 * 定义函数： size_t strspn(const char *str, const char * accept);
 * 函数说明： strspn() 从参数 str 字符串的开头计算连续的字符，
              而这些字符都完全是 accept 所指字符串中的字符。
			  简单的说，若 strspn() 返回的数值为n，则代表字符串 str 开头连续有 n 个字符都是属于字符串 accept 内的字符。
 * 返回值  ： 返回字符串 str 开头连续包含字符串 accept 内的字符数目。
              所以，如果 str 所包含的字符都属于 accept，那么返回 str 的长度；
			  如果 str 的第一个字符不属于 accept，那么返回 0。
 * 附加说明： 检索的字符是区分大小写的。
***************************************************************/

size_t strcspn(const char *str, const char * accept);
/*************************************************
 * 功能说明： 计算字符串 str 中连续有几个字符都不属于字符串 accept
 * 表头文件： #include <string.h>
 * 定义函数： size_t strcspn(const char *str, const char * accept);
***************************************************************/

char * strrchr(const char *str, int c);
/*************************************************
 * 功能说明： 查找某字符在字符串中最后一次出现的位置
 * 表头文件： #include <string.h>
 * 定义函数： char * strrchr(const char *str, int c);
 * 函数说明： str 为要查找的字符串，c 为要查找的字符。
			  strrchr() 将会找出 str 字符串中最后一次出现的字符 c 的地址，然后将该地址返回。
 
 * 返回值  ： 如果找到就返回该字符最后一次出现的位置，否则返回 NULL。
              返回的地址是字符串在内存中随机分配的地址再加上你所搜索的字符在字符串位置。
			  设字符在字符串中首次出现的位置为 i，那么返回的地址可以理解为 str + i。
 * 附加说明： 如果希望查找某字符在字符串中第一次出现的位置，可以使用 strchr() 函数。
***************************************************************/

 char * strchr (const char *str, int c);
/*************************************************
 * 功能说明： 查找某字符在字符串中首次出现的位置，
 * 表头文件： #include <string.h>
 * 定义函数： char * strchr (const char *str, int c);
 * 函数说明： str 为要查找的字符串，c 为要查找的字符。
			  strrchr() 将会找出 str 字符串中第一次出现的字符 c 的地址，然后将该地址返回。
 
 * 返回值  ： 如果找到就返回该字符最后一次出现的位置，否则返回 NULL。
              返回的地址是字符串在内存中随机分配的地址再加上你所搜索的字符在字符串位置。
			  设字符在字符串中首次出现的位置为 i，那么返回的地址可以理解为 str + i。
 * 附加说明： 如果希望查找某字符在字符串中第一次出现的位置，可以使用 strchr() 函数。
***************************************************************/

char *strpbrk( char *s1, char *s2);
/*************************************************
 * 功能说明： 检索两个字符串中首个相同字符的位置
 * 表头文件： #include <string.h>
 * 定义函数： char *strpbrk( char *s1, char *s2);
 * 函数说明： 从s1的第一个字符向后检索，直到'\0'，
              如果当前字符存在于s2中，那么返回当前字符的地址，并停止检索。
 
 * 返回值  ： 如果s1、s2含有相同的字符，那么返回指向s1中第一个相同字符的指针，否则返回NULL。
 * 附加说明： strpbrk()不会对结束符'\0'进行检索。
***************************************************************/

char * strncpy(char *dest, const char *src, size_t n);
/*************************************************
 * 功能说明： 复制字符串的前n个字符
 * 表头文件： #include <string.h>
 * 定义函数： char * strncpy(char *dest, const char *src, size_t n);
 * 函数说明： strncpy()会将字符串src前n个字符拷贝到字符串dest。
              不像strcpy()，strncpy()不会向dest追加结束标记'\0'，
			  这就引发了很多不合常理的问题：使用strncpy()最安全方式是使n等于strlen(src)+1
 
 * 返回值  ： 返回字符串dest
 * 附加说明： src 和 dest 所指的内存区域不能重叠，且 dest 必须有足够的空间放置n个字符。
***************************************************************/

char *strcpy(char *dest, const char *src);
/*************************************************
 * 功能说明： 字符串拷贝
 * 表头文件： #include <string.h>
 * 定义函数： char *strcpy(char *dest, const char *src);
 * 函数说明： strcpy()会将参数src 字符串拷贝至参数dest 所指的地址。
 
 * 返回值  ： 返回参数dest 的字符串起始地址。
 * 附加说明： 如果参数 dest 所指的内存空间不够大，可能会造成缓冲溢出(buffer Overflow)的错误情况，
              在编写程序时请特别留意，或者用strncpy()来取代。
***************************************************************/


char * strncat(char *dest, const char *src, size_t n);
/*************************************************
 * 功能说明： 将n个字符追加到字符串的结尾
 * 表头文件： #include <string.h>
 * 定义函数： char * strncat(char *dest, const char *src, size_t n);
 * 函数说明： dest为目标字符串，src为源字符串，n为要追加的字符的数目。
              strncat()将会从字符串src的开头拷贝n 个字符到dest字符串尾部，
			  dest要有足够的空间来容纳要拷贝的字符串。
			  如果n大于字符串src的长度，那么仅将src全部追加到dest的尾部。
              strncat()会将dest字符串最后的'\0'覆盖掉，字符追加完成后，再追加'\0'。
 
 * 返回值  ： 返回字符串dest
 * 附加说明： 
***************************************************************/

char *strcat(char *dest, const char *src);
/*************************************************
 * 功能说明： 连接字符串
 * 表头文件： #include <string.h>
 * 定义函数： char *strcat(char *dest, const char *src);
 * 函数说明： strcat() 会将参数 src 字符串复制到参数 dest 所指的字符串尾部；
              dest 最后的结束字符 NULL 会被覆盖掉，并在连接后的字符串的尾部再增加一个 NULL。
 
 * 返回值  ： 返回dest 字符串起始地址
 * 附加说明： dest 与 src 所指的内存空间不能重叠，且 dest 要有足够的空间来容纳要复制的字符串
***************************************************************/

unsigned int strlen (char *s);
/*************************************************
 * 功能说明： 计算字符串的长度
 * 表头文件： #include <string.h>
 * 定义函数： unsigned int strlen (char *s);
 * 函数说明： strlen()用来计算指定的字符串s 的长度，不包括结束字符"\0"。
 
 * 返回值  ： 返回字符串s的字符数。
 * 附加说明： char str[100] = "http://see.xidian.edu.cn/cpp/u/biaozhunku/";
              sizeof(str)=100，strlen(str)=11；		  
***************************************************************/

char * strdup(const char *s);
/*************************************************
 * 功能说明： 
 * 表头文件： #include <string.h>
 * 定义函数： char * strdup(const char *s);
 * 函数说明： strdup()会先用maolloc()配置与参数s 字符串相同的空间大小，
              然后将参数s 字符串的内容复制到该内存地址，然后把该地址返回。
              该地址最后可以利用free()来释放。
 
 * 返回值  ： 返回一字符串指针，该指针指向复制后的新字符串地址。
              若返回NULL 表示内存不足。
 * 附加说明：  
***************************************************************/

int strcoll( const char * str1, const char * str2 );
/*************************************************
 * 功能说明： 根据环境变量LC_COLLATE来比较字符串
 * 表头文件： #include <string.h>
 * 定义函数： int strcoll( const char * str1, const char * str2 );
 * 函数说明： strcoll() 会依环境变量 LC_COLLATE 所指定的文字排列次序来比较 s1 和 s2 字符串。
              默认情况下，LC_COLLATE 为"POSIX"或"C"，strcoll() 和 strcmp() 一样根据ASCII比较字符串大小。
              对于设置了 LC_COLLATE 语言环境的情况下，则根据 LC_COLLATE 设置的语言排序方式进行比较。
			  例如，汉字会根据拼音进行比较。
 
 * 返回值  ： 若字符串 str1 和 str2 相同则返回0。
              若 str1 大于 str2 则返回大于 0 的值，否则返回小于 0 的值。
 * 附加说明：  
***************************************************************/

int strcmp(const char *s1, const char *s2);
/*************************************************
 * 功能说明： 比较字符串
 * 表头文件： #include <string.h>
 * 定义函数： int strcmp(const char *s1, const char *s2);
 * 函数说明： 字符串大小的比较是以ASCII 码表上的顺序来决定，此顺序亦为字符的值。
              strcmp()首先将s1 第一个字符值减去s2 第一个字符值，若差值为0 则再继续比较下个字符，若差值不为0 则将差值返回。
			  例如字符串"Ac"和"ba"比较则会返回字符"A"(65)和'b'(98)的差值(－33)。
 
 * 返回值  ： 若字符串 str1 和 str2 相同则返回0。
              若 str1 大于 str2 则返回大于 0 的值，否则返回小于 0 的值。
 * 附加说明：  
***************************************************************/

int strncmp ( const char * str1, const char * str2, size_t n );
/*************************************************
 * 功能说明： 比较字符串前n个字符
 * 表头文件： #include <string.h>
 * 定义函数： int strncmp ( const char * str1, const char * str2, size_t n );
 * 函数说明： 字符串大小的比较是以ASCII 码表上的顺序来决定，此顺序亦为字符的值。
              strcmp()首先将s1 第一个字符值减去s2 第一个字符值，若差值为0 则再继续比较下个字符，若差值不为0 则将差值返回。
 
 * 返回值  ： 若字符串 str1 和 str2 前n个字符相同，则返回0。
              若str1大于str2则返回大于0的值，否则返回小于0的值。
 * 附加说明： 要比较的字符包括字符串结束标志'\0'，而且一旦遇到'\0'就结束比较，
              无论n是多少，不再继续比较后边的字符。
***************************************************************/

int strcasecmp (const char *s1, const char *s2);
/*************************************************
 * 功能说明： 比较字符串，忽略大小写
 * 表头文件： #include <string.h>
 * 定义函数： int strcasecmp (const char *s1, const char *s2);
 * 函数说明： strcasecmp()用来比较参数s1 和s2 字符串，比较时会自动忽略大小写的差异。
 
 * 返回值  ： 若参数s1 和s2 字符串相同则返回0。
              s1 若大于s2 则返回大于0 的值，s1 若小于s2 则返回小于0 的值。
 * 附加说明： 
***************************************************************/

int strncasecmp(const char *s1, const char *s2, size_t n);
/*************************************************
 * 功能说明： 比较字符串的前n个字符，忽略大小写
 * 表头文件： #include <string.h>
 * 定义函数： int strncasecmp(const char *s1, const char *s2, size_t n);
 * 函数说明： strncasecmp()用来比较参数s1 和s2 字符串前n个字符，比较时会自动忽略大小写的差异。
 
 * 返回值  ： 若参数s1 和s2 字符串相同则返回0。
              s1 若大于s2 则返回大于0 的值，s1 若小于s2 则返回小于0 的值。
 * 附加说明： 
***************************************************************/

char * rindex(const char *s, int c);
/*************************************************
 * 功能说明： 最后一次出现的地址
 * 表头文件： #include <string.h>
 * 定义函数： char * rindex(const char *s, int c);
 * 函数说明： rindex()用来找出参数s 字符串中最后一个出现的参数c 地址，
              然后将该字符出现的地址返回。字符串结束字符(NULL)也视为字符串一部分。
 
 * 返回值  ： 如果找到指定的字符则返回该字符所在的地址，否则返回0。
 * 附加说明：  
***************************************************************/

char * index(const char *s, int c);
/*************************************************
 * 功能说明： 第一次出现的地址
 * 表头文件： #include <string.h>
 * 定义函数： char * index(const char *s, int c);
 * 函数说明： index()用来找出参数s 字符串中第一个出现的参数c 地址，然后将该字符出现的地址返回。
              字符串结束字符(NULL)也视为字符串一部分。
 
 * 返回值  ： 如果找到指定的字符则返回该字符所在的地址，否则返回0。
 * 附加说明：  
***************************************************************/







